<?php

$data = [
    [
        'html' => '<i>Текст</i>',
        'description' => 'Курсивный текст',
        'example' => '<i>Текст</i>'
    ],
    [
        'html' => '<u>Текст</u>',
        'description' => 'Подчеркнутый текст',
        'example' => '<u>Текст</u>'
    ],
    [
        'html' => '<b>Текст</b>',
        'description' => 'Жирное начертание текста',
        'example' => '<b>Текст</b>'
    ],
    [
        'html' => '<s>Текст</s>',
        'description' => 'Перечеркнутый текст',
        'example' => '<s>Текст</s>'
    ],
    [
        'html' => '<br>',
        'description' => 'Перенос строки',
        'example' => ''
    ],
    [
        'html' => '<sup>Текст</sup>',
        'description' => 'Верхний индекс',
        'example' => '<sup>Текст</sup>'
    ],
    [
        'html' => '<sub>Текст</sub>',
        'description' => 'Нижний индекс',
        'example' => '<sub>Текст</sub>'
    ],
    
];

pHeader('Строчные элементы', 1);

pList([
    'Располагаются слева направо;',
    'Величина элемента равна размеру содержимого;',
    'В строчный элемент можно вкладывать только строчные элементы;'
], true);

pCodeBlock('<span>Строчный элемент</span>', 'Стандартный строчный элемент SPAN');

pHeader('Список строчных элементов', 2);

pTable(['HTML-код', 'Описание', 'Пример'], $data);
